app/Controllers/Reports.php

    public function index()
    {
        try {
            $reports = $this->reportsModel->findAll();
---
SELECT *
FROM `reports`

    public function show($id = null)
    {
        try {
            $report = $this->reportsModel->find($id);
---
SELECT *
FROM `reports`
WHERE `reports`.`id` = '3'