app/Controllers/Suppliers.php

INSERT INTO `suppliers` (`company_name`, `contact_person`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('test1', 'test1', 'test1@gmail.com', '09567812345', '2025-05-07 19:27:13', '2025-05-07 19:27:13')
---
    public function create()
    {
        try {
            $input = $this->request->getJSON(true);

            // Validate required fields
            $required = ['company_name', 'contact_person', 'email', 'phone'];
            foreach ($required as $field) {
                if (empty($input[$field])) {
                    return $this->fail("$field is required");
                }
            }

            $supplierId = $this->model->insert($input);

DELETE FROM `suppliers`
WHERE `id` IN ('6')
---
    public function delete($id = null)
    {
        try {
            if (!$this->model->delete($id)) {
                return $this->fail('Failed to delete supplier');
            }

            return $this->respondDeleted(['status' => 'success', 'message' => 'Supplier deleted successfully']);
        } catch (\Exception $e) {
            log_message('error', '[Suppliers::delete] ' . $e->getMessage());