app/Models/ProductModel.php

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
---
    public function getWithCategories()
    {
        return $this->select('products.*, categories.name as category_name')
                    ->join('categories', 'categories.id = products.category_id')
                    ->findAll();